{"class_name": "Model", "keras_version": "2.1.5", "config": {"output_layers": [["SIGMOID_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "INPUT", "config": {"sparse": false, "batch_input_shape": [null, 98], "name": "INPUT", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "EMBEDDING", "config": {"input_dim": 400002, "batch_input_shape": [null, null], "embeddings_constraint": null, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "input_length": null, "mask_zero": false, "trainable": false, "dtype": "float32", "name": "EMBEDDING", "output_dim": 50}, "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "LSTM_1", "config": {"bias_regularizer": null, "units": 128, "return_state": false, "activation": "tanh", "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unroll": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "return_sequences": true, "name": "LSTM_1", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}, "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "DROPOUT_1", "config": {"name": "DROPOUT_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.0}, "inbound_nodes": [[["LSTM_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"bias_regularizer": null, "units": 60, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}}, "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "LSTM_2", "config": {"bias_regularizer": null, "units": 128, "return_state": false, "activation": "tanh", "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unroll": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "return_sequences": false, "name": "LSTM_2", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "DROPOUT_2", "config": {"name": "DROPOUT_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.0}, "inbound_nodes": [[["LSTM_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"bias_regularizer": null, "units": 30, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"bias_regularizer": null, "units": 1, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "SIGMOID_1", "config": {"trainable": true, "activation": "sigmoid", "name": "SIGMOID_1"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["INPUT", 0, 0]]}, "backend": "tensorflow"}