{"keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["INPUT", 0, 0]], "output_layers": [["SIGMOID_1", 0, 0]], "layers": [{"name": "INPUT", "class_name": "InputLayer", "config": {"name": "INPUT", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 65]}, "inbound_nodes": []}, {"name": "EMBEDDING", "class_name": "Embedding", "config": {"trainable": false, "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": null, "batch_input_shape": [null, null], "embeddings_constraint": null, "input_dim": 400002, "output_dim": 50, "name": "EMBEDDING", "dtype": "float32", "activity_regularizer": null}, "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 128, "recurrent_dropout": 0.0, "trainable": true, "use_bias": true, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "name": "LSTM_1", "return_sequences": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "unroll": false, "recurrent_constraint": null, "return_state": false, "stateful": false, "activation": "tanh", "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null}}, "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]]}, {"name": "DROPOUT_1", "class_name": "Dropout", "config": {"name": "DROPOUT_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.0}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_regularizer": null, "units": 60, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null}, "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]]}, {"name": "LSTM_2", "class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 128, "recurrent_dropout": 0.0, "trainable": true, "use_bias": true, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "name": "LSTM_2", "return_sequences": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "unroll": false, "recurrent_constraint": null, "return_state": false, "stateful": false, "activation": "tanh", "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "DROPOUT_2", "class_name": "Dropout", "config": {"name": "DROPOUT_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.0}, "inbound_nodes": [[["LSTM_2", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"kernel_regularizer": null, "units": 30, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null}, "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"kernel_regularizer": null, "units": 1, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "SIGMOID_1", "class_name": "Activation", "config": {"name": "SIGMOID_1", "activation": "sigmoid", "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}]}}