{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "INPUT", "config": {"batch_input_shape": [null, 65], "name": "INPUT", "sparse": false, "dtype": "float32"}}, {"class_name": "Embedding", "inbound_nodes": [[["INPUT", 0, 0, {}]]], "name": "EMBEDDING", "config": {"activity_regularizer": null, "batch_input_shape": [null, null], "dtype": "float32", "output_dim": 50, "mask_zero": false, "input_length": null, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_constraint": null, "trainable": false, "name": "EMBEDDING", "input_dim": 400002}}, {"class_name": "LSTM", "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]], "name": "LSTM_1", "config": {"unroll": false, "name": "LSTM_1", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "go_backwards": false, "return_sequences": true, "kernel_constraint": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 128, "stateful": false, "recurrent_constraint": null, "trainable": true, "dropout": 0.0, "unit_forget_bias": true, "implementation": 1}}, {"class_name": "Dropout", "inbound_nodes": [[["LSTM_1", 0, 0, {}]]], "name": "DROPOUT_1", "config": {"trainable": true, "name": "DROPOUT_1", "rate": 0.0, "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]], "name": "LSTM_2", "config": {"unroll": false, "name": "LSTM_2", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "go_backwards": false, "return_sequences": false, "kernel_constraint": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 128, "stateful": false, "recurrent_constraint": null, "trainable": true, "dropout": 0.0, "unit_forget_bias": true, "implementation": 1}}, {"class_name": "Dropout", "inbound_nodes": [[["LSTM_2", 0, 0, {}]]], "name": "DROPOUT_2", "config": {"trainable": true, "name": "DROPOUT_2", "rate": 0.0, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]], "name": "DENSE_1", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 64, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "DENSE_1", "kernel_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["DENSE_1", 0, 0, {}]]], "name": "DENSE_2", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 1, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "DENSE_2", "kernel_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["DENSE_2", 0, 0, {}]]], "name": "SIGMOID_1", "config": {"trainable": true, "name": "SIGMOID_1", "activation": "sigmoid"}}], "input_layers": [["INPUT", 0, 0]], "output_layers": [["SIGMOID_1", 0, 0]]}, "keras_version": "2.1.5"}