{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "INPUT", "config": {"name": "INPUT", "batch_input_shape": [null, 65], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "EMBEDDING", "config": {"mask_zero": false, "output_dim": 50, "name": "EMBEDDING", "input_length": null, "embeddings_constraint": null, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "embeddings_regularizer": null, "trainable": false, "input_dim": 400002, "activity_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "LSTM_1", "config": {"recurrent_regularizer": null, "return_sequences": true, "dropout": 0.0, "trainable": true, "activation": "tanh", "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "unroll": false, "kernel_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "LSTM_1", "return_state": false, "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "DROPOUT_1", "config": {"seed": null, "name": "DROPOUT_1", "trainable": true, "noise_shape": null, "rate": 0.0}, "inbound_nodes": [[["LSTM_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 60, "name": "dense_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "LSTM_2", "config": {"recurrent_regularizer": null, "return_sequences": false, "dropout": 0.0, "trainable": true, "activation": "tanh", "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "unroll": false, "kernel_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "LSTM_2", "return_state": false, "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "DROPOUT_2", "config": {"seed": null, "name": "DROPOUT_2", "trainable": true, "noise_shape": null, "rate": 0.0}, "inbound_nodes": [[["LSTM_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 30, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"units": 1, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["INPUT", 0, 0]]}}