{"keras_version": "2.1.5", "config": {"output_layers": [["SIGMOID_1", 0, 0]], "input_layers": [["INPUT", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 65], "sparse": false, "name": "INPUT"}, "inbound_nodes": [], "name": "INPUT", "class_name": "InputLayer"}, {"config": {"input_dim": 400002, "dtype": "float32", "name": "EMBEDDING", "input_length": null, "embeddings_constraint": null, "trainable": false, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "activity_regularizer": null, "output_dim": 50, "embeddings_regularizer": null, "batch_input_shape": [null, null]}, "inbound_nodes": [[["INPUT", 0, 0, {}]]], "name": "EMBEDDING", "class_name": "Embedding"}, {"config": {"merge_mode": "concat", "name": "bidirectional_1", "trainable": true, "layer": {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "LSTM_1", "recurrent_constraint": null, "unroll": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "bias_regularizer": null, "implementation": 1, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}}, "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional"}, {"config": {"seed": null, "noise_shape": null, "name": "DROPOUT_1", "rate": 0.0, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "DROPOUT_1", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 60, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "LSTM_2", "recurrent_constraint": null, "unroll": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "bias_regularizer": null, "implementation": 1, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "LSTM_2", "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "name": "DROPOUT_2", "rate": 0.0, "trainable": true}, "inbound_nodes": [[["LSTM_2", 0, 0, {}]]], "name": "DROPOUT_2", "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 30, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "SIGMOID_1"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "SIGMOID_1", "class_name": "Activation"}]}, "backend": "tensorflow", "class_name": "Model"}