{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "INPUT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "dtype": "float32", "sparse": false, "name": "INPUT"}, "inbound_nodes": []}, {"name": "EMBEDDING", "class_name": "Embedding", "config": {"name": "EMBEDDING", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 400002, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"name": "LSTM_1", "class_name": "LSTM", "config": {"name": "LSTM_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["EMBEDDING", 0, 0, {}]]]}, {"name": "DROPOUT_1", "class_name": "Dropout", "config": {"name": "DROPOUT_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["LSTM_1", 0, 0, {}]]]}, {"name": "LSTM_2", "class_name": "LSTM", "config": {"name": "LSTM_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["DROPOUT_1", 0, 0, {}]]]}, {"name": "DROPOUT_2", "class_name": "Dropout", "config": {"name": "DROPOUT_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["LSTM_2", 0, 0, {}]]]}, {"name": "DENSE_1", "class_name": "Dense", "config": {"name": "DENSE_1", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["DROPOUT_2", 0, 0, {}]]]}, {"name": "SIGMOD_1", "class_name": "Activation", "config": {"name": "SIGMOD_1", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["DENSE_1", 0, 0, {}]]]}], "input_layers": [["INPUT", 0, 0]], "output_layers": [["SIGMOD_1", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}